<details ><summary>plan for monitoring 2025-02-26 02:41:52 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#monitoring has been locked by PR #13
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.grafana will be updated in-place
  ~ resource "cloudns_dns_record" "grafana" {
        id    = "564862136"
      ~ name  = "monitoring" -> (known after apply)
      ~ value = "o1rv3loljd8ot0ef4gjj98trts.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.grafana.module.grafana_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.prometheus.module.prometheus_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (monitoring)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                 RESOURCE                                  |
|--------|---------------------------------------------------------------------------|
| add    | `module.grafana.module.grafana_deployment.akash_deployment.service`       |
|        | `module.mysql.module.mysql_deployment.akash_deployment.service`           |
|        | `module.prometheus.module.prometheus_deployment.akash_deployment.service` |
| update | `cloudns_dns_record.grafana`                                              |

</details>

</details>